Repository: qa-point/xceasy
Catalog: XCEasy/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# api_manager_send_request
source: Send [%@] request
ru: Отправить [%@] запрос

# api_manager_send_request_error
source: Request failed with error: [ %@ ]
ru: Запрос не выполнен из-за ошибки: [ %@ ]

# assert_contains_error
source: Error! [%@] not contains [%@]!
ru: Ошибка! [%@] не содержит [%@]!

# assert_contains_title
source: Checking that [%@] contains [%@]
ru: Проверка, что [%@] содержит [%@]

# assert_element_label
source: Checking element [%@] label is [%@]
ru: Проверка, что лейбл элемента [%@] равен [%@]

# assert_element_value
source: Checking element [%@] value is [%@]
ru: Проверка, что значение элемента [%@] равно [%@]

# assert_equals_error
source: Error! Value [%@] is not equal to [%@]!
ru: Ошибка! Значение [%@] не равно [%@]!

# assert_equals_title
source: Checking that the value of [%@] is equal to [%@]
ru: Проверка, что значение [%@] равно [%@]

# assert_false_error
source: Error! Value [%@] is true!
ru: Ошибка! Значение [%@] истинно!

# assert_false_title
source: Checking the [%@] is false
ru: Проверка, что значение [%@] ложно

# assert_greater_than_error
source: Error! Value [%@] is not greater than [%@]!
ru: Ошибка! Значение [%@] не больше [%@]!

# assert_greater_than_title
source: Checking if value [%@] is greater than [%@]
ru: Проверка, что значение [%@] больше [%@]

# assert_greater_or_equal_error
source: Error! Element [%@] is less than [%@]!
ru: Ошибка! Элемент [%@] меньше [%@]!

# assert_greater_or_equal_title
source: Checking if value [%@] is greater or equal to [%@]
ru: Проверка, что значение [%@] больше или равно [%@]

# assert_is_enabled_label
source: Enabled value of %@
ru: Значение включен ли элемент %@

# assert_is_enabled_title
source: Checking if element [%@] is enabled
ru: Проверка, что элемент [%@] включен

# assert_disappears_title
source: Verify that [%@] disappears
ru: Проверить исчезновение [%@]

# assert_is_hidden_title
source: Verify that [%@] is hidden
ru: Проверить, что [%@] скрыт

# assert_is_not_hittable_title
source: Verify that [%@] is not hittable
ru: Проверить, что [%@] недоступен для нажатия

# assert_is_not_displayed_title
source: Verify that [%@] is not displayed on screen
ru: Проверить, что [%@] не отображается на экране

# assert_is_displayed_title
source: Verify that [%@] is displayed on screen
ru: Проверить, что [%@] отображается на экране

# assert_is_exists_label
source: Existence of %@
ru: Присутствие элемента %@

# assert_is_exists_title
source: Checking that element [%@] exists in the accessibility tree
ru: Проверка, что элемент [%@] присутствует в дереве элементов

# assert_is_hittable_label
source: Hittable value of %@
ru: Значение кликабельности элемента %@

# assert_is_hittable_title
source: Checking if element [%@] is hittable
ru: Проверка, что на элемент [%@] можно тапнуть

# assert_is_not_enabled_label
source: Non-enabled value of %@
ru: Значение выключен ли элемент %@

# assert_is_not_enabled_title
source: Checking if element [%@] is not enabled
ru: Проверка, что элемент [%@] выключен

# assert_is_not_exists_label
source: Non-existence of %@
ru: Отсутствие элемента %@

# assert_is_not_exists_title
source: Checking that element [%@] is absent from the accessibility tree
ru: Проверка, что элемент [%@] отсутствует в дереве элементов

# assert_is_not_selected_label
source: Non-selected value of %@
ru: Значение выбора(выделения) элемента %@

# assert_is_not_selected_title
source: Checking if element [%@] is not selected
ru: Проверка, что элемент [%@] не выбран

# assert_is_selected_label
source: Selected value of %@
ru: Значение выбора(выделения) элемента %@

# assert_is_selected_title
source: Checking if element [%@] is selected
ru: Проверка, что элемент [%@] выбран

# assert_less_than_error
source: Error! Value [%@] is not less than [%@]!
ru: Ошибка! Значение [%@] не меньше [%@]!

# assert_less_than_title
source: Checking if value [%@] is less than [%@]
ru: Проверка, что значение [%@] меньше [%@]

# assert_less_or_equal_error
source: Error! Element [%@] is greater than [%@]!
ru: Ошибка! Элемент [%@] больше [%@]!

# assert_less_or_equal_title
source: Checking if value [%@] is less or equal to [%@]
ru: Проверка, что значение [%@] меньше или равно [%@]

# assert_empty_error
source: Error! Collection [%@] is not empty!
ru: Ошибка! Коллекция [%@] не пуста!

# assert_empty_title
source: Checking that collection [%@] is empty
ru: Проверка, что коллекция [%@] пуста

# assert_nil_error
source: Error! Element [%@] is not nil!
ru: Ошибка! Элемент [%@] не пустой!

# assert_nil_title
source: Checking if element [%@] is nil
ru: Проверка, что элемент [%@] пустой

# assert_not_contains_error
source: Error! [%@] contains [%@]!
ru: Ошибка! [%@] содержит [%@]!

# assert_not_contains_title
source: Checking that [%@] not contains [%@]
ru: Проверка, что [%@] не содержит [%@]

# assert_not_equals_error
source: Error! Value [%@] is equal to [%@]!
ru: Ошибка! Значение [%@] равно [%@]!

# assert_not_equals_title
source: Checking that the value of [%@] is not equal to [%@]
ru: Проверка, что значение [%@] не равно [%@]

# assert_not_empty_error
source: Error! Collection [%@] is empty!
ru: Ошибка! Коллекция [%@] пуста!

# assert_not_empty_title
source: Checking that collection [%@] is not empty
ru: Проверка, что коллекция [%@] не пуста

# assert_not_nil_error
source: Error! Element [%@] is nil!
ru: Ошибка! Элемент [%@] пустой!

# assert_not_nil_title
source: Checking if element [%@] is not nil
ru: Проверка, что элемент [%@] не пустой

# assert_true_error
source: Error! Value [%@] is false!
ru: Ошибка! Значение [%@] ложно!

# assert_true_title
source: Checking the [%@] is true
ru: Проверка, что значение [%@] истинно

# assert_throws_error
source: Error! Operation [%@] did not throw an error!
ru: Ошибка! Операция [%@] не выбросила ошибку!

# assert_throws_title
source: Checking that operation [%@] throws an error
ru: Проверка, что операция [%@] выбрасывает ошибку

# assert_does_not_throw_error
source: Error! Operation [%@] threw an error!
ru: Ошибка! Операция [%@] выбросила ошибку!

# assert_does_not_throw_title
source: Checking that operation [%@] does not throw
ru: Проверка, что операция [%@] не выбрасывает ошибку

# asserts_default_element_title
source: Element
ru: Элемент

source: Clear text field
ru: Очистить поле ввода

# close_application_title
source: Close Application
ru: Закрыть приложение

# device_orientation_face_down
source: Face down
ru: Лицом вниз

# device_orientation_face_up
source: Face up
ru: Лицом вверх

# device_orientation_landscape_left
source: Landscape left
ru: Горизонтально слева

# device_orientation_landscape_right
source: Landscape right
ru: Горизонтально справа

# device_orientation_portrait
source: Portrait
ru: Вертикально

# device_orientation_portrait_upside_down
source: Portrait upside down
ru: Вертикально вверх ногами

# device_orientation_unknown
source: Unknown
ru: Неизвестно

# double_tap_on_element_title
source: Double tap on element [%@]
ru: Двойное нажатие на элемент[%@]

# down_direction
source: Down
ru: Вниз

# get_clipboard_value
source: Get value from clipboard
ru: Получить значение из буфера обмена

# launch_application_title
source: Launch Application
ru: Запустить приложение

# left_direction
source: Left
ru: Влево

# open_deeplink_title
source: Open deeplink [%@]
ru: Открыть диплинк [%@]

# press_on_element_title
source: Press element [%@] for duration [%@]
ru: Зажимать элемент [%@] в течение [%@]

# reopen_application_title
source: Reopen Application
ru: Переоткрыть приложение

# right_direction
source: right
ru: Вправо

# screen_position_bottom_center
source: Bottom center
ru: Снизу по центру

# screen_position_center
source: Center
ru: По центру

# screen_position_left_bottom
source: Left bottom
ru: Слева внизу

# screen_position_left_center
source: Left center
ru: Cлева по центру

# screen_position_left_top
source: Left top
ru: Слева сверху

# screen_position_right_bottom
source: Right bottom
ru: Справа снизу

# screen_position_right_center
source: Right center
ru: Справа по центру

# screen_position_right_top
source: Right top
ru: Справа сверху

# screen_position_top_center
source: Top center
ru: Сверху по центру

# screen_press_title
source: Press and hold the screen at [%@] for [%@] seconds
ru: Зажимать экран в точке [%@] в течение [%@] секунд

# screen_swipe_title
source: Swipe from [%@] to [%@]
ru: Сделать свайп из точки [%@] до точки [%@]

# screen_tap_title
source: Tap the [%@] on the screen
ru: Нажать на точку [%@] на экране

# set_launch_arguments_title
source: Set LaunchArguments
ru: Установка LaunchArguments

# set_launch_environment_title
source: Set LaunchEnvironment
ru: Установка LaunchEnvironment

source: Set orientation [%@]
ru: Установить ориентацию [%@]

# swipe_element_title
source: Swipe [%@] element [%@]
ru: Свайпнуть [%@] элемент [%@]

# element_value_missing_error
source: Element [%@] has no value to clear
ru: У элемента [%@] нет значения для очистки

# tap_on_element_title
source: Tap on element [%@]
ru: Нажать на элемент [%@]

# ui_action_not_ready_error
source: Element [%@] did not satisfy action policy [%@] within [%@] seconds
ru: Элемент [%@] не достиг состояния для политики действия [%@] за [%@] секунд

# type_text_to_element_title
source: Enter text into [%@]
ru: Ввести текст в [%@]

# up_direction
source: Up
ru: Вверх

source: Wait for [%@] seconds
ru: Ожидать в течение [%@] секунд

# component_collection_assert_all_displayed
source: Check that all current components are displayed
ru: Проверить, что все текущие компоненты отображаются

# component_collection_assert_count_at_least
source: Check that component count is at least [%lld]
ru: Проверить, что компонентов не меньше [%lld]

# component_collection_assert_count_at_most
source: Check that component count is at most [%lld]
ru: Проверить, что компонентов не больше [%lld]

# component_collection_assert_count_exact
source: Check that component count equals [%lld]
ru: Проверить, что количество компонентов равно [%lld]

# component_collection_assert_empty
source: Check that the component collection is empty
ru: Проверить, что коллекция компонентов пуста

# component_collection_assert_not_empty
source: Check that the component collection is not empty
ru: Проверить, что коллекция компонентов не пуста

# component_collection_assertion_failed
source: %@. Actual component count: [%lld].
ru: %@. Фактическое количество компонентов: [%lld].

# component_collection_select_first
source: Create locator for the first component
ru: Создать локатор первого компонента

# component_collection_select_index
source: Create locator for component at index [%lld]
ru: Создать локатор компонента с индексом [%lld]

# component_collection_select_last
source: Create locator for the last component
ru: Создать локатор последнего компонента

# component_collection_select_range
source: Create component locators for indices [%lld]..<[%lld]
ru: Создать локаторы компонентов для индексов [%lld]..<[%lld]

# component_collection_wait_all_displayed
source: Wait until all current components are displayed
ru: Дождаться отображения всех текущих компонентов

# component_collection_wait_count_at_least
source: Wait until component count is at least [%lld]
ru: Дождаться, когда компонентов будет не меньше [%lld]

# component_collection_wait_count_at_most
source: Wait until component count is at most [%lld]
ru: Дождаться, когда компонентов будет не больше [%lld]

# component_collection_wait_count_exact
source: Wait until component count equals [%lld]
ru: Дождаться количества компонентов [%lld]

# xceasy_allure_config_title
source: Set XCEasyAllureConfig
ru: Параметры XCEasyAllureConfig

# xceasy_basic_config_title
source: Set XCEasyConfig
ru: Параметры XCEasyConfig
